import React, { useState, useEffect } from 'react';
import ShowComponent  from "./components/showComponentFunc.js";
const BioSection = () => {
  const [dynamicText, setDynamicText] = useState('');
  const [isVisible, setIsVisible] = useState(false); // State to manage visibility

    const texts = [
        'إِنَّمَا الْأَعْمَالُ بِالنِّيَاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى',
        'خَيْرُ الْأَعْمَالِ أَدْوَمُهَا وَإِنْ قَلَّ',
        'صَلَاةُ الْجَمَاعَةِ أَفْضَلُ مِنْ صَلَاةِ أَحَدِكُمْ وَحْدَهُ بِخَمْسَةٍ وَعِشْرِينَ جُزْءًا',
        'مَنْ صَلَّى الْعِشَاءَ فِي جَمَاعَةٍ فَكَأَنَّمَا قَامَ نِصْفَ اللَّيْلِ، وَمَنْ صَلَّى الصُّبْحَ فِي جَمَاعَةٍ فَكَأَنَّمَا قَامَ اللَّيْلَ كُلَّهُ',
        'مَا مِنْ عَبْدٍمُسْلِمٍ يُصَلِّي لِلَّهِ كُلَّ يَوْمٍ ثَنْتَيْ عَشْرَةَ رَكْعَةً تَطَوُّعًا، غَيْرَ فَرِيضَةٍ، إِلَّا بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ',
        'كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْعُ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ قَبْلَ الْغَدَاةِ',
        'رَكْعَتَا الْفَجْرِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا',
        'عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: أَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ: صِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ، وَرَكْعَتَيْ الضُّحَى، وَأَنْ أُوتِرَ قَبْلَ أَنْ أَنَامَ',
        'أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ فَأَكْثِرُوا الدُّعَاءَ',
        'مَنْ صَامَ رَمَضَانَ، إِيمَانًا وَاحْتِسَابًا، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ',
        'لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ',
        'كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الْمِيزَانِ، حَبِيبَتَانِ إِلَى الرَّحْمَنِ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ',
        'الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ، وَفِي كُلِّ خَيْرٍ، احْرِصْ عَلَى مَا يَنْفَعُكَ، وَاسْتَعِنْ بِاللَّهِ وَلَا تَعْجَزْ.',
        'خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ',
        'مَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ',
        'الدُّنْيَا سِجْنُ الْمُؤْمِنِ وَجَنَّةُ الْكَافِرِ',
        'الصَّلَوَاتُ الْخَمْسُ، وَالْجُمُعَةُ إِلَى الْجُمُعَةِ، وَرَمَضَانُ إِلَى رَمَضَانَ، مُكَفِّرَاتٌ مَا بَيْنَهُنَّ إِذَا اجْتَنَبَتْ الْكَبَائِرَ',
        'إِنَّ الْعَبْدَ لَيَتَكَلَّمُ بِالْكَلِمَةِ، مَا يُتَبِيَّنُ مَا فِيهَا، يُهْوِي بِهَا فِي النَّارِ، أَبْعَدَ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ',
        'سَبَابُ الْمُسْلِمِ فُسُوقٌ، وَقِتَالُهُ كُفْرٌ',
        'مَنْ تَرَكَ صَلَاةَ الْعَصْرِ حَبِطَ عَمَلُهُ',
        'لَا يَلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ وَاحِدٍ مَرَّتَيْنِ',
        'لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ، إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الْغَضَبِ',
        'الْعِبَادَةُ فِي الْهَرَجِ كَهِجْرَةٍ إِلَيَّ',
        'بَادِرُوا بِالْأَعْمَالِ فِتَنًا كَقِطْعِ اللَّيْلِ الْمُظْلِمِ، يُصْبِحُ الرَّجُلُ مُؤْمِنًا وَيُمْسِي كَافِرًا، أَوْ يُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا، يَبِيعُ دِينَهُ بِعَرَضٍ مِنَ الدُّنْيَا',
        '',
    ];

 useEffect(() => {
    // Shuffle the texts array
    const shuffledTexts = [...texts].sort(() => Math.random() - 0.5);

    let textIndex = 0;
    const interval = 50; // Adjust typing speed here (milliseconds)

    const typeTexts = () => {
      if (textIndex >= shuffledTexts.length) {
        textIndex = 0; // Reset index to start from the beginning
      }
      const text = shuffledTexts[textIndex];
      let charIndex = 0;

      const typingInterval = setInterval(() => {
        if (charIndex < text.length) {
          setDynamicText(prevText => prevText + text.charAt(charIndex));
          charIndex++;
        } else {
          clearInterval(typingInterval);
          setTimeout(() => {
            setDynamicText('');
            textIndex++;
            typeTexts();
          }, 1500); // Delay before typing the next text (milliseconds)
        }
      }, interval);
    };

    // Show the component after a delay
    ShowComponent(() => {
      setIsVisible(true);
      setTimeout(() => {
      typeTexts(); // Start typing text
  }, 1500);
    });

    return () => clearInterval(ShowComponent);
  }, []); // Only run once on component mount

  return (
    <section id="bio" className={`bio section ${isVisible ? 'visible' : ''}`}>
      <h1 className="bio__heading">
        قال النبي صلى الله عليه وسلم
        <br />
        <span className="bio__title dynamic__text">{dynamicText}</span>
      </h1>
    </section>
  );
};

export default BioSection;